HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC27_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BE8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC27_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BEAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC27_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC27_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BEEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC27_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BA8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC27_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BAAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC27_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC27_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BAEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC27_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BB0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC27_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062BB2u)

/** \\brief  C, Revision ID Register */
#define MC27_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0062B0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc28
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC28_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0062C00u)

/** \\brief  2, Configuration Register 1 */
#define MC28_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0062C02u)

/** \\brief  10, Memory ECC Detection Register */
#define MC28_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0062C10u)

/** \\brief  E, ECC Safety Register */
#define MC28_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0062C0Eu)

/** \\brief  12, Error Tracking Register */
#define MC28_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062C12u)

/** \\brief  14, Error Tracking Register */
#define MC28_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062C14u)

/** \\brief  16, Error Tracking Register */
#define MC28_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062C16u)

/** \\brief  18, Error Tracking Register */
#define MC28_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062C18u)

/** \\brief  1A, Error Tracking Register */
#define MC28_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062C1Au)

/** \\brief  4, MBIST Control Register */
#define MC28_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0062C04u)

/** \\brief  6, Status Register */
#define MC28_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0062C06u)

/** \\brief  8, Range Register, single address mode */
#define MC28_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0062C08u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC28_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CA0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC28_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CA2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC28_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CB4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC28_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CB6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC28_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CB8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC28_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CBAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC28_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CBCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC28_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CBEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC28_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CC0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC28_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CC2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC28_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CC4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC28_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CC6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC28_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CA4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC28_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CC8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC28_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CCAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC28_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CCCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC28_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CCEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC28_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CD0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC28_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CD2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC28_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CD4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC28_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CD6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC28_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CD8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC28_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CDAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC28_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CA6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC28_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CDCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC28_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CDEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC28_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CE0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC28_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CE2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC28_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CE4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC28_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CE6u)

