HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC29_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DE8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC29_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DEAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC29_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC29_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DEEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC29_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DA8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC29_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DAAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC29_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC29_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DAEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC29_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DB0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC29_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DB2u)

/** \\brief  C, Revision ID Register */
#define MC29_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0062D0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc30
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC30_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0062E00u)

/** \\brief  2, Configuration Register 1 */
#define MC30_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0062E02u)

/** \\brief  10, Memory ECC Detection Register */
#define MC30_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0062E10u)

/** \\brief  E, ECC Safety Register */
#define MC30_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0062E0Eu)

/** \\brief  12, Error Tracking Register */
#define MC30_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062E12u)

/** \\brief  14, Error Tracking Register */
#define MC30_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062E14u)

/** \\brief  16, Error Tracking Register */
#define MC30_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062E16u)

/** \\brief  18, Error Tracking Register */
#define MC30_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062E18u)

/** \\brief  1A, Error Tracking Register */
#define MC30_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062E1Au)

/** \\brief  4, MBIST Control Register */
#define MC30_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0062E04u)

/** \\brief  6, Status Register */
#define MC30_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0062E06u)

/** \\brief  8, Range Register, single address mode */
#define MC30_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0062E08u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC30_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EA0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC30_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EA2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC30_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EB4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC30_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EB6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC30_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EB8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC30_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EBAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC30_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EBCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC30_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EBEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC30_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EC0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC30_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EC2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC30_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EC4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC30_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EC6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC30_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EA4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC30_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EC8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC30_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062ECAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC30_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062ECCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC30_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062ECEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC30_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062ED0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC30_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062ED2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC30_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062ED4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC30_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062ED6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC30_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062ED8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC30_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EDAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC30_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EA6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC30_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EDCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC30_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EDEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC30_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EE0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC30_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EE2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC30_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EE4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC30_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062EE6u)

