HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC83_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC83_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC83_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC83_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC83_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC83_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC83_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC83_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC83_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC83_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00663B2u)

/** \\brief  C, Revision ID Register */
#define MC83_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006630Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc84
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC84_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0066400u)

/** \\brief  2, Configuration Register 1 */
#define MC84_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0066402u)

/** \\brief  10, Memory ECC Detection Register */
#define MC84_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0066410u)

/** \\brief  E, ECC Safety Register */
#define MC84_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006640Eu)

/** \\brief  12, Error Tracking Register */
#define MC84_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066412u)

/** \\brief  14, Error Tracking Register */
#define MC84_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066414u)

/** \\brief  16, Error Tracking Register */
#define MC84_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066416u)

/** \\brief  18, Error Tracking Register */
#define MC84_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066418u)

/** \\brief  1A, Error Tracking Register */
#define MC84_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006641Au)

/** \\brief  4, MBIST Control Register */
#define MC84_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0066404u)

/** \\brief  6, Status Register */
#define MC84_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0066406u)

/** \\brief  8, Range Register, single address mode */
#define MC84_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0066408u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC84_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC84_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC84_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC84_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC84_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC84_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC84_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC84_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC84_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC84_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC84_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC84_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC84_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC84_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC84_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC84_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC84_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC84_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC84_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC84_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC84_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC84_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC84_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC84_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC84_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC84_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC84_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC84_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC84_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC84_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664E6u)

