HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC84_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC84_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC84_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC84_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC84_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC84_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC84_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC84_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC84_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC84_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00664B2u)

/** \\brief  C, Revision ID Register */
#define MC84_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006640Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc85
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC85_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0066500u)

/** \\brief  2, Configuration Register 1 */
#define MC85_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0066502u)

/** \\brief  10, Memory ECC Detection Register */
#define MC85_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0066510u)

/** \\brief  E, ECC Safety Register */
#define MC85_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006650Eu)

/** \\brief  12, Error Tracking Register */
#define MC85_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066512u)

/** \\brief  14, Error Tracking Register */
#define MC85_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066514u)

/** \\brief  16, Error Tracking Register */
#define MC85_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066516u)

/** \\brief  18, Error Tracking Register */
#define MC85_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066518u)

/** \\brief  1A, Error Tracking Register */
#define MC85_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006651Au)

/** \\brief  4, MBIST Control Register */
#define MC85_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0066504u)

/** \\brief  6, Status Register */
#define MC85_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0066506u)

/** \\brief  8, Range Register, single address mode */
#define MC85_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0066508u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC85_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC85_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC85_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC85_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC85_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC85_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC85_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC85_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC85_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC85_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC85_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC85_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC85_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC85_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC85_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC85_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC85_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC85_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC85_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC85_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC85_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC85_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC85_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC85_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC85_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC85_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC85_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC85_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC85_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC85_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665E6u)

