HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC86_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC86_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC86_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC86_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC86_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC86_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC86_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC86_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC86_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC86_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666B2u)

/** \\brief  C, Revision ID Register */
#define MC86_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006660Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc87
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC87_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0066700u)

/** \\brief  2, Configuration Register 1 */
#define MC87_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0066702u)

/** \\brief  10, Memory ECC Detection Register */
#define MC87_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0066710u)

/** \\brief  E, ECC Safety Register */
#define MC87_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006670Eu)

/** \\brief  12, Error Tracking Register */
#define MC87_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066712u)

/** \\brief  14, Error Tracking Register */
#define MC87_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066714u)

/** \\brief  16, Error Tracking Register */
#define MC87_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066716u)

/** \\brief  18, Error Tracking Register */
#define MC87_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066718u)

/** \\brief  1A, Error Tracking Register */
#define MC87_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006671Au)

/** \\brief  4, MBIST Control Register */
#define MC87_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0066704u)

/** \\brief  6, Status Register */
#define MC87_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0066706u)

/** \\brief  8, Range Register, single address mode */
#define MC87_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0066708u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC87_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC87_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC87_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC87_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC87_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC87_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC87_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC87_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC87_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC87_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC87_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC87_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC87_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC87_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC87_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC87_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC87_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC87_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC87_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC87_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC87_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC87_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC87_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC87_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC87_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC87_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC87_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC87_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC87_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC87_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00667E6u)

